# Pandas Exercises

** Import pandas and read in the banklist.csv file into a dataframe called df. **

In [143]:
import pandas as pd

In [144]:
df=pd.read_csv('banklist.csv')

** Show the head of the dataframe **

In [145]:
# CODE HERE

In [6]:
df.head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [ ]:
# CODE HERE

In [7]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [ ]:
# CODE HERE

In [56]:
df=pd.read_csv('banklist.csv')
df=df.drop_duplicates('ST')
len(df['ST'].values)

44

** Get a list or array of all the states in the data set. **

In [ ]:
# CODE HERE

In [55]:
df=pd.read_csv('banklist.csv')
df=df.drop_duplicates('ST')
df['ST'].values

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** What are the top 5 states with the most failed banks? **

In [ ]:
# CODE HERE

In [147]:
df=pd.read_csv('banklist.csv')
df['count']=1
df=df.groupby('ST').sum()
df=df.sort_values(by=['count'],ascending=[False])
pd.DataFrame(df['count'].head(5))

    count
ST
GA     93
FL     75
IL     67
CA     41
MN     23

** What are the top 5 acquiring institutions? **

In [ ]:
# CODE HERE

In [148]:
df=pd.read_csv('banklist.csv')
df['count']=1
df=df.groupby('Acquiring Institution').sum()
df=df.sort_values(by=['count'],ascending=[False])
pd.DataFrame(df['count'].head(5))

                                     count
Acquiring Institution
No Acquirer                             31
State Bank and Trust Company            12
First-Citizens Bank & Trust Company     11
Ameris Bank                             10
U.S. Bank N.A.                           9

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [ ]:
# CODE HERE

In [13]:
df[df['Acquiring Institution']=='State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [ ]:
# CODE HERE

In [150]:
df=pd.read_csv('banklist.csv')
df=df[df['ST']=='CA']
df['count']=1
df=df.groupby('City').sum()
df=df.sort_values(by=['count'],ascending=[False])
pd.DataFrame(df['count'].head(1))

             count
City
Los Angeles      4

** How many failed banks don't have the word "Bank" in their name? **

In [ ]:
# CODE HERE

In [91]:
df=pd.read_csv('banklist.csv')
bank=df['Bank Name']
bank=pd.DataFrame(bank.str.contains('Bank'))
len(bank[bank['Bank Name']==False])

14

** How many bank names start with the letter 's' ? **

In [ ]:
# CODE HERE

In [74]:
df=pd.read_csv('banklist.csv')
Bank_Name=df['Bank Name']
Bank_Name=Bank_Name.str.startswith('S')
len(Bank_Name[Bank_Name.values]==True)

53

** How many CERT values are above 20000 ? **

In [61]:
# CODE HERE

In [18]:
len(df[df['CERT']>20000])

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [65]:
# CODE HERE

In [136]:
df=pd.read_csv('banklist.csv')
count = df['Bank Name'].str.split().apply(len).value_counts()
count.index = count.index.astype(str) + ' words:'
count.sort_index(inplace=True)
count=pd.DataFrame(count)
count[count.index=='2 words:'].values[0,0]

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [ ]:
# CODE HERE

In [142]:
df=pd.read_csv('banklist.csv')
df=df['Closing Date']
df=df.str.contains('-08')
df=pd.DataFrame(df)
len(df[df['Closing Date']==True])

25